---
kind: method
id: M:Autodesk.Revit.DB.AddInId.#ctor(System.Guid)
source: html/f98d8e20-a546-aa27-1833-45fcb8c99e6c.htm
---
# Autodesk.Revit.DB.AddInId.#ctor Method

creates an AddInId object with a given GUID

## Syntax (C#)
```csharp
public AddInId(
	Guid val
)
```

## Parameters
- **val** (`System.Guid`) - GUID value